def tesbih_cek (sayi,tesbih)
for i in 1..sayi
  system("clear")
  puts "*******************************************************************************************************************************************************"
  puts "*******************************************************************************************************************************************************"
  puts "*******************************************************************************************************************************************************"
  puts ""
  puts ""
  puts ""
  puts ""
  puts ""
  puts "    #{i} - #{tesbih}                                                                                                                                   "
  puts ""
  puts ""
  puts ""
  puts ""
  puts ""
  puts "*******************************************************************************************************************************************************"
  puts "*******************************************************************************************************************************************************"
  puts "*******************************************************************************************************************************************************"
  d=gets.chomp
end
system("clear")
puts "*******************************************************************************************************************************************************"
puts "************************************************************************Tesbih Tamamlandı**************************************************************"
puts "*******************************************************************************************************************************************************"
puts "Devam Etmek İçin Bir Tuşa Basın..."
d=gets.chomp
end

system("clear")
tesbihler=["Allah","Allahu Ekber","Subhan Allah","La İlahe İllallah Muhammedür Resulullah","Allahüme Salli Ala Seyyidina Muhammedin Ve Ala Ali Seyyidina Muhammed"]
puts "***************************************************************************************************************************************************"
puts "******************************************************************Tesbih Çekme Programı************************************************************"
puts "***************************************************************************************************************************************************"

puts ""
puts ""
puts ""
puts ""
puts ""
puts "1- 100 kere 'Estağfirullah Elhamdülillah.'"
d=gets.chomp
tesbih_cek(100,"Estağfirullah Elhamdülillah.")
puts "2- 100 kere 'Allahüme Salli Ala Seyyidina Muhammedin Ve Ala Ali Seyyidina Muhammed.'"
d=gets.chomp
tesbih_cek(100,"Allahüme Salli Ala Seyyidina Muhammedin Ve Ala Ali Seyyidina Muhammed.")

s=1

while s > 0 do
puts ""
puts ""
puts ""
puts ""
puts ""

for i in 0..(tesbihler.length-1)
  met=tesbihler[i]
  r=i+1
  puts "#{r} ) #{met}"
end
puts ""
puts ""
puts "3-Lütfen Tesbihin Numarasını Girin:"
tesbih = gets.chomp
tesbih= tesbih.to_i - 1
tesbih=tesbihler[tesbih]
puts "4-Lütfen Kaç Kere Çekeceğinizi Yazın:"
sayi=gets.chomp
sayi=sayi.to_i
tesbih_cek(sayi,tesbih)
end
